In [ ]:
# Load libraries
import missingno as msno 
import re
import pickle
import pandas as pd
import numpy as np

import sys
np.set_printoptions(threshold=sys.maxsize)

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
# Load Data
with open('/content/mn_final_output.pkl', 'rb') as f:
    output_1850 = pickle.load(f)
    
with open('/content/final_output.pkl', 'rb') as f:
    output_1880 = pickle.load(f)
    
with open('/content/bk_final_output.pkl', 'rb') as f:
    output_1850_bk = pickle.load(f)
    
# Replace empty strings with NaN values
output_1850.replace('', np.nan, inplace=True)
output_1880.replace('', np.nan, inplace=True)
output_1850_bk.replace('', np.nan, inplace=True)

output_1850_bk = pd.read_csv("/content/output_1850_bk.csv", index_col=0)

Clean widow flags

1850 manhattan

In [ ]:
len(output_1850.loc[(output_1850['Widow-flag'] == 'False')  &  (output_1850['Full Address'].str.startswith('widow'))])

64

In [ ]:
print(output_1850.loc[(output_1850['Widow-flag'] == 'False')  &  (output_1850['Full Address'].str.startswith('widow of')), 'Full Address'].str.split().str[0:3])


for i in range(1,len(output_1850)):
 if ((output_1850['Widow-flag'][str(i)] == 'False') & (str(output_1850['Full Address'][str(i)]).startswith('widow of'))):
    output_1850.loc[str(i),'Widow-flag'] = 'True'
    output_1850.loc[str(i),'Widow of'] = output_1850['Full Address'][str(i)].split()[2]
    output_1850.loc[str(i),'Full Address'] =" ".join(output_1850['Full Address'][str(i)].split()[3:])

 if ((output_1850['Widow-flag'][str(i)] == 'False') & (str(output_1850['Full Address'][str(i)]).startswith("widow' of"))):
    output_1850.loc[str(i),'Widow-flag'] = 'True'
    output_1850.loc[str(i),'Widow of'] = output_1850['Full Address'][str(i)].split()[2]
    output_1850.loc[str(i),'Full Address'] =" ".join(output_1850['Full Address'][str(i)].split()[3:])

 if ((output_1850['Widow-flag'][str(i)] == 'False') & (str(output_1850['Full Address'][str(i)]).startswith("widow- of"))):
    output_1850.loc[str(i),'Widow-flag'] = 'True'
    output_1850.loc[str(i),'Widow of'] = output_1850['Full Address'][str(i)].split()[2]
    output_1850.loc[str(i),'Full Address'] =" ".join(output_1850['Full Address'][str(i)].split()[3:])

 if ((output_1850['Widow-flag'][str(i)] == 'False') & (str(output_1850['Full Address'][str(i)]).startswith("widowâ€™ of"))):
    output_1850.loc[str(i),'Widow-flag'] = 'True'
    output_1850.loc[str(i),'Widow of'] = output_1850['Full Address'][str(i)].split()[2]
    output_1850.loc[str(i),'Full Address'] =" ".join(output_1850['Full Address'][str(i)].split()[3:])

output_1850.loc[(output_1850['Widow-flag'] == 'False')  &  (output_1850['Full Address'].str.startswith('widow')), 'Widow-flag'] = 'True'
output_1850['Full Address'] = output_1850['Full Address'].str.replace('widow ','')

114           [widow, of, David.]
1330           [widow, of, Sars.]
4495           [widow, of, Ebrd.]
5073          [widow, of, Daniel]
7490           [widow, of, James]
8503            [widow, of, Geo.]
10465         [widow, of, James.]
13098            [widow, of, Wm.]
15929       [widow, of, Roswell.]
16477     [widow, of, Thomas,'r.]
18368     [widow, of, Frederick.]
27884           [widow, of, Jos.]
28658        [widow, of, Patrick]
30353          [widow, of, John.]
31766       [widow, of, William.]
31768         [widow, of, Peter.]
35213         [widow, of, Jacob.]
35267          [widow, of, Benj.]
35373    [widow, of, Stephen,.r.]
38668          [widow, of, John.]
40540       [widow, of, Henry,85]
40872          [widow, of, Thos.]
42012       [widow, of, William.]
43465         [widow, of, (Rev.)]
45315        [widow, of, Philip.]
45960          [widow, of, Alex.]
45966           [widow, of, Geo.]
47727          [widow, of, Alex.]
48452          [widow, of, James]
49865         [widow, of, David.]
50202       [widow, of, William.]
50797           [widow, of, John]
52363        [widow, of, Joshua.]
52373         [widow, of, George]
55151         [widow, of, Joseph]
55186         [widow, of, Hiram.]
55847     [widow, of, Frederick.]
55981            [widow, of, Wm.]
57924        [widow, of, Daniel.]
59419     [widow, of, Frederick.]
59985            [widow, of, 011]
61191          [widow, of, John.]
61518       [widow, of, William.]
65800        [widow, of, Isaiah.]
70316    [widow, of, Jeremiah,49]
72904           [widow, of, A.H.]
73549         [widow, of, John,']
73952          [widow, of, Henry]
75225    [widow, of, William,682]
75682         [widow, of, Sahel.]
76975       [widow, of, William.]
77257     [widow, of, Isaac,r.44]
79292      [widow, of, Benjamin.]
79335          [widow, of, Peter]
79468       [widow, of, William.]
Name: Full Address, dtype: object

In [ ]:
len(output_1850.loc[(output_1850['Widow-flag'] == 'False')  &  (output_1850['Full Address'].str.startswith('widow'))])

0

1880 cd

In [ ]:
# widow flag = true if full address contains widow word and widow flag was false
len(output_1880.loc[(output_1880['Widow-flag'] == 'False')  &  (output_1880['Full Address'].str.startswith('widow'))])

4

In [ ]:
print(output_1880.loc[(output_1880['Widow-flag'] == 'False')  &  (output_1880['Full Address'].str.startswith('widow')), 'Full Address'])

output_1880.loc[(output_1850['Widow-flag'] == 'False')  &  (output_1880['Full Address'].str.startswith('widow')), 'Widow-flag'] = 'True'
output_1880['Full Address'] = output_1880['Full Address'].str.replace('widow ','')

65722                widow h 348 E. 33d
89062                widow h 340 E. 33d
91135               widow h 405 E. 71st
139014    widow (refused) h 443 W. 37th
Name: Full Address, dtype: object

In [ ]:
# widow flag = true if full address contains widow word and widow flag was false
len(output_1880.loc[(output_1880['Widow-flag'] == 'False')  &  (output_1880['Full Address'].str.startswith('widow'))])

0

combine occupations from all the three files

Keep the occupations which are atleast 3 letter words to avoid unnecessary errors

In [ ]:
# non null values
output_1850_bk['Occupation'] = output_1850_bk['Occupation'].str.replace(')','')
output_1850['Occupation'] = output_1850['Occupation'].str.replace(')','')
output_1880['Occupation'] = output_1880['Occupation'].str.replace(')','')

output_1850_bk['Occupation'] = output_1850_bk['Occupation'].str.replace('.','')
output_1850['Occupation'] = output_1850['Occupation'].str.replace('.','')
output_1880['Occupation'] = output_1880['Occupation'].str.replace('.','')

output_1850_bk['Occupation'] = output_1850_bk['Occupation'].str.replace(',','')
output_1850['Occupation'] = output_1850['Occupation'].str.replace(',','')
output_1880['Occupation'] = output_1880['Occupation'].str.replace(',','')

x = output_1850_bk.loc[output_1850_bk['Occupation'].notnull(), ['Occupation']]
x = x.append(output_1850.loc[output_1850['Occupation'].notnull(), ['Occupation']])
x = x.append(output_1880.loc[output_1880['Occupation'].notnull(), ['Occupation']])

x = x[~(x.Occupation.str.len() < 4)]
x['Occupation'] = x['Occupation'].str.lower()

Currently there are 14k occupations

In [ ]:
len(x.Occupation.unique())
#len(x)

14458

find rows where occupation is null

In [ ]:
# find rows where occupation is null
y = output_1850.loc[(output_1850['Occupation'].isnull()) & (output_1850['Full Address'].notnull()), ['Full Address']]
y['Full Address'] = y['Full Address'].str.replace('.',' ')
# 7984 nulls

print(len(y))

# keep records where address has more than one word
for i in range(len(y)):
  if (len(y['Full Address'][i].split()))<2:
    y['Full Address'][i] = None

y = y.loc[y['Full Address'].notnull(), ['Full Address']]
y

7984

                                     Full Address
4                  Albro Benjamin sen  328 Bowery
8                                 barber 34 Av  C
11                                   h  175 Canal
12                                    137 Norfolk
26                               E  24th c  Av  3
...                                           ...
79468                               676 Greenwich
79469                                 29 Clarkson
79470                                  124 W  22d
79520  Youngs Henry jr  10 Broadway, h  218 Av  9
79521                        carman,' 35 Hamilton

[7683 rows x 1 columns]

In [ ]:
# we need o find there are any matches within 7683 full adress

Find if there is an exact match for occupations as substring in the address column

In [ ]:
z = y['Full Address'].str.extract('(%s)' % '|'.join([re.escape(x) for x in x.Occupation.unique()]))
z.columns = ['occupation']
z = z.loc[z['occupation'].notnull(), ['occupation']]
len(z)

1047

In [ ]:
z.loc[(z.occupation == 'hotel') | (z.occupation == 'boarding house') | (z.occupation == 'foot of' ) | (z.occupation == 'market' ) | (z.occupation == 'office' ) | (z.occupation == 'coffee' ) | (z.occupation == 'select school'), 'occupation'] = None
z.loc[(z.occupation == 'stone yard') | (z.occupation == 'railroad') | (z.occupation == 'express' ), 'occupation'] = None

z.loc[(z.occupation == 'purser'), 'occupation'] = "purser's clerk"
z.loc[(z.occupation == 'sheet iron worker'), 'occupation'] = "tin and sheet iron worker  "

In [ ]:
z = z.loc[z['occupation'].notnull(), ['occupation']]
len(z)

1012

In [ ]:
len(z.occupation.unique())

289

A total of 1k records found a match for occupations in their addresses

In [ ]:
#output_1850_bk = output_1850_bk.drop(['occupation'], axis=1)
output_1850 = output_1850.join(z)

In [ ]:
output_1850['len_occ']=0
output_1850.loc[(output_1850['occupation'].notnull()),'len_occ'] = output_1850.loc[(output_1850['occupation'].notnull()),'occupation'].str.len()

Assumption is that the address will start with occupation in case the occupation column is null, so match the found occupation substring with the starting words in the address columns

In [ ]:
#z.loc[z['Full Address'].notnull(), 'Full Address'].str[0:z.iloc[z['len_occ']]]

output_1850['Old_Occupation_info'] = output_1850['Occupation']
output_1850['add_sub_match'] = '0'
output_1850['new_occ_found'] = 'False'

for i in range(len(output_1850)):
  output_1850['add_sub_match'][i] = str(output_1850.iloc[i]['Full Address'])[0:output_1850.iloc[i]["len_occ"]]

  if ((output_1850['occupation'][i] == output_1850['add_sub_match'][i])):
    output_1850['new_occ_found'][i] = 'True'

    if (len(output_1850['Full Address'][i].split(',')) > 1):
      output_1850['Occupation'][i] = output_1850['Full Address'][i].split(',')[0]
    else:
      output_1850['Occupation'][i] = output_1850['occupation'][i]


  if ((output_1850['new_occ_found'][i] == 'False') & (str(output_1850['Full Address'][i]).startswith('mer'))):
    output_1850['new_occ_found'][i] = 'True'
    output_1850['Occupation'][i] = 'merchant'

Mark the occupation found column as assume if there are still matches in the previous step but the address column doesnot start with the matched occupation

In [ ]:
for i in range(len(output_1850)):
  if ((output_1850['new_occ_found'][i] == 'False') & (str(output_1850.iloc[i]['occupation']) != 'nan')):
    output_1850['new_occ_found'][i] = 'assume'
    output_1850['Occupation'][i] = output_1850['occupation'][i]

In [ ]:
print(len(output_1850.loc[(output_1850['new_occ_found'] == 'True')]))

output_1850.loc[(output_1850['new_occ_found'] == 'True')].head()

493

                        Full Name    First Name  ... add_sub_match new_occ_found
8                    Anthes Peter         Peter  ...        barber          True
324   Abbott MaryAnn,wid. Merrick  MaryAnn,wid.  ...        sewing          True
336               Abbott Walter S        Walter  ...       saddler          True
793              AITKEN RAPHAEL F       RAPHAEL  ...        grocer          True
1118                Allen Richard       Richard  ...     warehouse          True

[5 rows x 26 columns]

In [ ]:
print(len(output_1850.loc[(output_1850['new_occ_found'] == 'assume')]))

536

try more fuzzy name match algorithms for remaining records

In [ ]:
# try more fuzzy  name match algorithms

uni_occ = x.Occupation.unique()

import pandas as pd
!pip install fuzzywuzzy
from fuzzywuzzy import process, fuzz

def find_match(x):

    match = process.extract(x, uni_occ, scorer=fuzz.WRatio, limit=1)
    return pd.Series([match[0][0], match[0][1]])

In [ ]:
len(uni_occ)

14458

subset those records which not recognized by substring matching (7196 out of 7683)

In [ ]:
# rows where occupation is null
nm_match_add = output_1850.loc[(output_1850['Old_Occupation_info'].isnull()) & (output_1850['new_occ_found'] != 'True') & (output_1850['Full Address'].notnull()), ['Full Address']]
nm_match_add['Full Address'] = nm_match_add['Full Address'].str.replace('.',' ')
# 7984 nulls

print(len(nm_match_add))
print(len(y))


# keep records where address has more than one word
for i in range(len(nm_match_add)):
  if (len(nm_match_add['Full Address'][i].split()))<2:
    nm_match_add['Full Address'][i] = None

nm_match_add = nm_match_add.loc[nm_match_add['Full Address'].notnull(), ['Full Address']]
nm_match_add

7497
7683

                                     Full Address
4                  Albro Benjamin sen  328 Bowery
11                                   h  175 Canal
12                                    137 Norfolk
26                               E  24th c  Av  3
35                                 24th n  Av  10
...                                           ...
79459                                405 Broadway
79468                               676 Greenwich
79469                                 29 Clarkson
79470                                  124 W  22d
79520  Youngs Henry jr  10 Broadway, h  218 Av  9

[7196 rows x 1 columns]

In [ ]:
nm_match_add

                                     Full Address
4                  Albro Benjamin sen  328 Bowery
11                                   h  175 Canal
12                                    137 Norfolk
26                               E  24th c  Av  3
35                                 24th n  Av  10
...                                           ...
79459                                405 Broadway
79468                               676 Greenwich
79469                                 29 Clarkson
79470                                  124 W  22d
79520  Youngs Henry jr  10 Broadway  h  218 Av  9

[7196 rows x 1 columns]

clean the records remove digits and special characters to run fuzzy name match

In [ ]:
import re
# clean the records remove digits and special characters 
for i in range(len(nm_match_add)):
  nm_match_add['Full Address'][i] = re.sub("[^a-zA-Z0-9]", 
                          " ",     
                          str(nm_match_add['Full Address'][i]))
  
  nm_match_add['Full Address'][i] = str(nm_match_add['Full Address'][i])


for i in range(len(uni_occ)):
  uni_occ[i] = re.sub("[^a-zA-Z0-9]", 
                          " ",     
                          str( uni_occ[i]))
  
  uni_occ[i] = str(uni_occ[i])

In [ ]:
# do name matching only for false and assume in new_occ_found 
nm_match_add['new_occ'] = 'False'
nm_match_add['match_rating'] = 0

count = 0
for i in range(len(nm_match_add)):
  split_str = str(nm_match_add['Full Address'][i]).split(",")
  match = find_match(split_str[0])
  nm_match_add['new_occ'][i] =match[0]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      
  nm_match_add['match_rating'][i] = match[1]

  if ((len(split_str) > 1) & (nm_match_add['match_rating'][i] < 90)):
    match = find_match(split_str[1]) 
    if match[1] > nm_match_add['match_rating'][i]:
      nm_match_add['new_occ'][i] =match[0]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      
      nm_match_add['match_rating'][i] = match[1]
    
  count = count + 1
  if (count % 100 == 0):
    print(count)

In [ ]:
# fuzzy name matched length to be >3 
   
# if new_occ found is true then keep occupation as substring_match
                                                                                                                                                                                                                                                                                                                                                                                                                                                     
# else if new_occ found = False or assume and fuzzy match >=90 then update occupation and new_occ found = name_match

# else keep the assumed occupation

In [ ]:
nm_match_add.to_csv('1850mn_fuzzymatch_output.csv')
output_1850.to_csv('1850mn_occmatch_output.csv')

In [ ]:
output_1850_mn = pd.read_csv("/content/1850mn_occmatch_output.csv", index_col=0)
#output_1850_mn = pd.read_csv("/content/output_1850_mn.csv", index_col=0)

fuzzy_name = pd.read_csv("/content/1850_mn_fuzzymatch.csv", index_col=0)

In [ ]:
# merge the fuzzy name matched table with original table where the matching score is >90
output_1850_mn = output_1850_mn.merge(fuzzy_name[['new_occ']], left_index= True, right_index= True, how ="left" )

In [ ]:
# if the new_occ_found col is not true and occupation column is null then replace occ with new_occ and new_occ_found with  name match
for i in range(1,len(output_1850_mn)):
  if ((output_1850_mn['new_occ_found'][i] != 'TRUE') & (str(output_1850_mn['new_occ'][i]) !='nan') & (str(output_1850_mn['Old_Occupation_info'][i]) =='nan')):
    output_1850_mn['new_occ_found'][i] = 'Name match'
    output_1850_mn['Occupation'][i] = output_1850_mn['new_occ'][i]

number of occupations found within each category: true, namematch and assume

In [ ]:
len(output_1850_mn.loc[(output_1850_mn['new_occ_found'] == 'TRUE')])

493

In [ ]:
len(output_1850_mn.loc[(output_1850_mn['new_occ_found'] == 'Name match')])

90

In [ ]:
len(output_1850_mn.loc[(output_1850_mn['new_occ_found'] == 'assume')])

29

In [ ]:
output_1850_mn.to_csv('output_1850_mn.csv')

There are a total of ~500 matches

Examples of absolute occupation match

In [ ]:
output_1850_mn.loc[(output_1850_mn['new_occ_found'] == 'TRUE'), ['Full Name','Occupation','Full Address']]

                         Full Name  ...                        Full Address
8                     Anthes Peter  ...                     barber 34 Av. C
324    Abbott MaryAnn,wid. Merrick  ...                   sewing,158W. 20th
336                Abbott Walter S  ...   saddler,273 Bowery ,h.187 Forsyth
793               AITKEN RAPHAEL F  ...       grocer,173 South , h.173 Sâ€™th
1118                 Allen Richard  ...                 warehouse,191 Water
...                            ...  ...                                 ...
79043               Wright Charles  ...                dancing h. 151 Tenth
79069                Wright George  ...         blacksmith. Av. 7 c. W. 22d
79107                Wright John D  ...  late importer 4 Pine, h. 8 W. 14th
79122                Wright Misses  ...                milliners,12 Carmine
79521                 Youngs James  ...                carman,' 35 Hamilton

[493 rows x 3 columns]

Examples of tricky name matches using name matching algorithm

In [ ]:
output_1850_mn.loc[(output_1850_mn['new_occ_found'] == 'Name match'), ['Full Name','Occupation','Full Address']]

             Full Name  ...                                       Full Address
489    Ackerman Warren  ...  secâ€™ry of the Newark india rubber manufacturin...
1665               NaN  ...     Anthony Alex.butcher,Washâ€™ton mkt,h.12 Bethune
2166               NaN  ...  AUGUSTA (Georgia) INSURANCE & BANKING Co. 76 Wall
2439               NaN  ...                    Bacon Sherman 5. mer. 132 Water
3912               NaN  ...              Bay John,'laborer , E. 13th n. Av. B.
...                ...  ...                                                ...
70020              NaN  ...      TaylorGeorge L.lawyer,20 Beekman,h.480Houston
72631              NaN  ...           UNITED STATES LIFE INSURANCE CO. 27 Wall
77310            Wilde  ...                    of John,seamstress,191 Franklin
77317              NaN  ...  Wilder George,hatpresser,155.5 Chrystie,h.252 ...
77800              NaN  ...        WILLIAMS & STEVENS,lookingglasses,353 B.way

[90 rows x 3 columns]

Examples of assume occupations

In [ ]:
output_1850_mn.loc[(output_1850_mn['new_occ_found'] == 'assume'), ['Full Name','Occupation','Full Address']]

                  Full Name  ...                                       Full Address
4047                    NaN  ...  Beames Henry P.tailor,88 Elizabeth,h.114Wesley pl
5756                    NaN  ...  Blauvelt Richâ€™d D.chairs,89 Bowry , h.196.5 Ch...
13041  Cochrane Archibald T  ...           watch manf.288 Greenwich h. 195 Chambers
13404       Coleman Herbert  ...                     surg.instrument mkr.131 Cannon
17137         DAVIS JAMES S  ...                     com.mer.63 Beaver,h.50 Charles
17669          Deger John R  ...                health inspector over Centre market
18095      Dennisson Joseph  ...                    Gouverneur fish mkt,h.331 Front
20860                   NaN  ...    Duyckinck Richard B.mer.62 Cedar,h.33 Monroe pl
21125   Eckcnfeld Magdalena  ...                      chairbottomr,E. 19th n. Av. 5
25214                   NaN  ...  Frisbie Myron J.rubbershoes,248 Pearl , h.610 ...
29371                   NaN  ...  Haight Henry,butcher,41 Rose & 100 Av.CJ,h.Fou...
33714                   NaN  ...  Holsten John,grocer,215 Rivington,h.215 R,ivin...
37884                   NaN  ...  Kellers John Frederick,grocer,2 Jones & 172 Fo...
40565                   NaN  ...  Lanphear Samuel,tailor,46 Av. 3,h.Twelfth c.Av. 3
43259                   NaN  ...  Luckey Joseph N.oildealer,44 Cortlandt,h.27 Hu...
43260                   NaN  ...    Luckey Samuel,drygoods,17 Cortlandt,h.27 Hubert
52813                   NaN  ...  NEWARK INDIA RUBBER MANUFACTURING CO. 59 Maide...
55566                   NaN  ...  Paulson Leonard,tailor,140 B.way ,h.1O5 Hoyt,B...
56817                   NaN  ...  Pine Joseph,carriagemaker,119 Walker,h.201 Hester
58648                   NaN  ...  Ransom Jonathan H boots,.32 Cortland,h.109 Second
60458                   NaN  ...                Roberts John mer. 62 Av. 9, h. Ohio
64740                   NaN  ...  Sherman WalterB.trunks,172 Chrystie & 408 Gran...
64817                   NaN  ...  Sherwood James M. (Rev.) editor 120 Nassau, h....
66077                   NaN  ...   Smith George,furniture,203 Wooster,h.203 Wooster
69027                   NaN  ...  STRONG W1LLIAM K. wool mer. 285 Pearl, h. 40 U...
70104          Taylor Lydia  ...  194 Ninth layW 19th a'nâ€™ lumberâ€™ W' 14th câ€™ Av...
74537        Wallace Samuel  ...                        propertymaker h. 181 Walker
75184                   NaN  ...  Washburn Willett L.artist,7.5 Bow'ery,h.7.5 Bo...
77322                   NaN  ...  Wildes Thomas,metals,30 Old sl.h.234 Bridge,Bkiyn

[29 rows x 3 columns]

use agglomerative clustering to cluster similar occupations and find best match for each cluster to standarize the occupations

In [ ]:

import numpy as np
import re
!pip install textdistance
import textdistance
# we will need scikit-learn>=0.21
from sklearn.cluster import AgglomerativeClustering

In [ ]:

text = output_1850_mn.loc[output_1850_mn['Occupation'].notnull(), ['Occupation']]
text['Occupation'] = text['Occupation'].str.lower()

len(text.Occupation.unique())

text = text.Occupation.unique()

In [ ]:

def normalize(text):
  """ Keep only lower-cased text and numbers"""
  return re.sub('[^a-z0-9]+', ' ', text.lower())

def group_texts(texts, threshold=0.3): 
  """ Replace each text with the representative of its cluster"""
  normalized_texts = np.array([normalize(text) for text in texts])
  distances = 1 - np.array([
      [textdistance.jaro_winkler(one, another) for one in normalized_texts] 
      for another in normalized_texts
  ])
  
  clustering = AgglomerativeClustering(
    distance_threshold=threshold, # this parameter needs to be tuned carefully
    affinity="precomputed", linkage="complete", n_clusters=None
  ).fit(distances)
  centers = dict()

  for cluster_id in set(clustering.labels_):
    index = clustering.labels_ == cluster_id
    centrality = distances[:, index][index].sum(axis=1)
    centers[cluster_id] = normalized_texts[index][centrality.argmin()]
  return [centers[i] for i in clustering.labels_]

In [ ]:
std_names = group_texts(text)
std_names[0:20]

['shoe maker',
 'mason',
 'carpenter',
 'merchant',
 'marble works',
 'milkman',
 'laborer',
 'furrier',
 'butcher',
 'accountant',
 'sash and blind maker ',
 'sash maker',
 'cap maker',
 'seaman r',
 'ship joiner',
 'printer',
 'builder ',
 'tailor',
 'music printer',
 'porterhouse']

In [ ]:
text = list(text)
text[0:20]

['shoemaker',
 'mason',
 'carpenter',
 'merchant',
 'marble sawyer',
 'milkman',
 'laborer',
 'furrier',
 'butcher',
 'accountant',
 'sash and blind maker',
 'sashmaker',
 'capmaker',
 'seaman',
 'ship joiner',
 'printer',
 'builder',
 'tailor',
 'music printer and engraver',
 'porter house']

In [ ]:
output_1850_mn = pd.DataFrame(text, columns=["orignal_name"]).join(pd.DataFrame(std_names, columns = ["new_name"]))

In [ ]:
output_1850_mn.to_csv("output_1850_mn.csv")